app/controllers/pictures_controller.rb

  def create
    new_url = params["url"]
    new_note = params["caption"]
    p = Picture.new
    p.url = new_url
    p.note = new_note
    p.save
---
INSERT INTO "pictures" ("created_at", "favorite", "note", "updated_at", "url") VALUES (?, ?, ?, ?, ?)

  def show
    pic_id = params["id"].to_i
    @picture = Picture.find_by_id(pic_id)
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = 1 LIMIT 1

  def edit
    @p = Picture.find_by_id(params[:id].to_i)
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = 2 LIMIT 1

  def update
  id = params[:id].to_i
  p = Picture.find_by_id id
  p.url = params[:url]
  p.note = params[:note]
  p.favorite = params[:favorite]
  if p.favorite == "on"
    p.favorite = true
  end
  p.save
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = 4 LIMIT 1
UPDATE "pictures" SET "url" = 'http://images.wikia.com/batman/images/9/9b/BaneModel1.jpg', "note" = 'Bane is da man', "updated_at" = '2012-07-18 15:57:10.173190' WHERE "pictures"."id" = 3

  def destroy
  id = params[:id].to_i
  p = Picture.find_by_id id
  p.destroy
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = 3 LIMIT 1
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 3]]